# CannotCopySunAndShadowSettingsWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopySunAndShadowSettingsWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
SunAndShadowSettings cannot be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopySunAndShadowSettingsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopySunAndShadowSettingsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettingsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace